# Pandas

## Series

In [3]:
import pandas as pn
import numpy as np

In [7]:
myDict = {"Berat" : 17, "Osman": 10}

In [8]:
pn.Series(myDict)

Berat    17
Osman    10
dtype: int64

In [9]:
myAgeList = [17,10]

In [10]:
myNameList = ["Berat", "Osman"]

In [21]:
pn.Series(myNameList, np.random.randint(0, 100, len(myNameList)))

50    Berat
72    Osman
dtype: object

In [22]:
yarisma1 = pn.Series(np.random.randint(0, 100, len(myNameList)), myNameList)

In [25]:
yarisma1

Berat    73
Osman    72
dtype: int32

In [26]:
print(yarisma1)

Berat    73
Osman    72
dtype: int32

In [28]:
yarisma1['Berat']

73

In [30]:
yarisma2 = pn.Series(index=myNameList, data=np.random.randint(0, 100, len(myNameList)))

In [32]:
yarisma2

Berat    85
Osman     9
dtype: int32

In [33]:
sonuc = yarisma1 + yarisma2
sonuc

Berat    158
Osman     81
dtype: int32

In [34]:
farkliSeries = pn.Series([1, 19, 60, 80], ["ax", "bx", "cx", "dx"])
farkliSeries2 = pn.Series([0, 20, 40, 300], ["ax", "bx", "fx", "gx"])
farkliSeries + farkliSeries2

ax     1.0
bx    39.0
cx     NaN
dx     NaN
fx     NaN
gx     NaN
dtype: float64

## DataFrame

In [4]:
data = np.random.randn(4,3)

In [5]:
dataFrame = pn.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  1.008778 -0.358705  0.927597
1  1.770948  0.339156 -0.080529
2  0.647858  1.213184  0.686979
3  0.681217  0.898573  0.244885

In [7]:
dataFrame[0]

0    1.008778
1    1.770948
2    0.647858
3    0.681217
Name: 0, dtype: float64

In [8]:
newDataFrame = pn.DataFrame(data, index=["Berat", "Şevval", "Hakan", "Fazilet"], columns=["Maaş", "Yaş", "Çalışma Saatleri"])

In [9]:
newDataFrame

             Maaş       Yaş  Çalışma Saatleri
Berat    1.008778 -0.358705          0.927597
Şevval   1.770948  0.339156         -0.080529
Hakan    0.647858  1.213184          0.686979
Fazilet  0.681217  0.898573          0.244885

In [10]:
newDataFrame["Çalışma Saatleri"]["Berat"]

0.9275965090919206

In [11]:
newDataFrame[["Maaş", "Yaş"]]

             Maaş       Yaş
Berat    1.008778 -0.358705
Şevval   1.770948  0.339156
Hakan    0.647858  1.213184
Fazilet  0.681217  0.898573

In [12]:
newDataFrame[["Maaş", "Yaş"]]

             Maaş       Yaş
Berat    1.008778 -0.358705
Şevval   1.770948  0.339156
Hakan    0.647858  1.213184
Fazilet  0.681217  0.898573

In [13]:
newDataFrame.loc["Berat"]

Maaş                1.008778
Yaş                -0.358705
Çalışma Saatleri    0.927597
Name: Berat, dtype: float64

In [14]:
newDataFrame.iloc[0]

Maaş                1.008778
Yaş                -0.358705
Çalışma Saatleri    0.927597
Name: Berat, dtype: float64

In [15]:
newDataFrame

             Maaş       Yaş  Çalışma Saatleri
Berat    1.008778 -0.358705          0.927597
Şevval   1.770948  0.339156         -0.080529
Hakan    0.647858  1.213184          0.686979
Fazilet  0.681217  0.898573          0.244885

In [17]:
newDataFrame.loc['Fazilet']

Maaş                0.681217
Yaş                 0.898573
Çalışma Saatleri    0.244885
Name: Fazilet, dtype: float64

In [19]:
newDataFrame.loc['Fazilet']['Maaş']

0.6812166059466478

In [20]:
newDataFrame.loc['Fazilet']['Maaş'] = 10

In [21]:
newDataFrame

              Maaş       Yaş  Çalışma Saatleri
Berat     1.008778 -0.358705          0.927597
Şevval    1.770948  0.339156         -0.080529
Hakan     0.647858  1.213184          0.686979
Fazilet  10.000000  0.898573          0.244885

In [22]:
newDataFrame.reset_index()

     index       Maaş       Yaş  Çalışma Saatleri
0    Berat   1.008778 -0.358705          0.927597
1   Şevval   1.770948  0.339156         -0.080529
2    Hakan   0.647858  1.213184          0.686979
3  Fazilet  10.000000  0.898573          0.244885

In [23]:
newDataFrame

              Maaş       Yaş  Çalışma Saatleri
Berat     1.008778 -0.358705          0.927597
Şevval    1.770948  0.339156         -0.080529
Hakan     0.647858  1.213184          0.686979
Fazilet  10.000000  0.898573          0.244885

In [24]:
newDataFrame.reset_index(inplace=True)

In [25]:
newDataFrame

     index       Maaş       Yaş  Çalışma Saatleri
0    Berat   1.008778 -0.358705          0.927597
1   Şevval   1.770948  0.339156         -0.080529
2    Hakan   0.647858  1.213184          0.686979
3  Fazilet  10.000000  0.898573          0.244885

In [34]:
newDataFrame = pn.DataFrame(["Mustafa", "Berat", "Selami", "Özlem"], np.random.randint(5, 100, 4))

In [35]:
newDataFrame

          0
37  Mustafa
88    Berat
34   Selami
43    Özlem

In [36]:
newSeries = pn.Series(["Mustafa", "Berat", "Selami", "Özlem"], np.random.randint(5, 100, 4))

In [37]:
newSeries

67    Mustafa
96      Berat
62     Selami
87      Özlem
dtype: object

In [52]:
random = np.random.randn(4,3)
newDataFrame = pn.DataFrame( random ,columns=["Maaş", "Saat", "Yaş"], index=newSeries.values)

In [53]:
newDataFrame

             Maaş      Saat       Yaş
Mustafa  0.032868 -1.953012  1.375672
Berat    1.446390 -0.641169  0.291806
Selami  -1.095312  0.178220 -0.356227
Özlem    0.342263  1.252266 -0.907654

In [55]:
newIndexList = ["Mus", "Ber", "Sel", "Özl"]
newDataFrame["New Index"] = newIndexList

In [56]:
newDataFrame

             Maaş      Saat       Yaş New Index
Mustafa  0.032868 -1.953012  1.375672       Mus
Berat    1.446390 -0.641169  0.291806       Ber
Selami  -1.095312  0.178220 -0.356227       Sel
Özlem    0.342263  1.252266 -0.907654       Özl

In [57]:
newDataFrame.set_index("New Index")

               Maaş      Saat       Yaş
New Index
Mus        0.032868 -1.953012  1.375672
Ber        1.446390 -0.641169  0.291806
Sel       -1.095312  0.178220 -0.356227
Özl        0.342263  1.252266 -0.907654

In [58]:
newDataFrame

             Maaş      Saat       Yaş New Index
Mustafa  0.032868 -1.953012  1.375672       Mus
Berat    1.446390 -0.641169  0.291806       Ber
Selami  -1.095312  0.178220 -0.356227       Sel
Özlem    0.342263  1.252266 -0.907654       Özl

In [59]:
newDataFrame.set_index("New Index", inplace=True)

In [60]:
newDataFrame

               Maaş      Saat       Yaş
New Index
Mus        0.032868 -1.953012  1.375672
Ber        1.446390 -0.641169  0.291806
Sel       -1.095312  0.178220 -0.356227
Özl        0.342263  1.252266 -0.907654

In [61]:
firstIndexs = ["Kurt", "Kurt", "Kurt", "Günay", "Günay", "Günay"]

In [62]:
secondIndexs = ["Mustafa Berat", "Ozlem", "Selami", "Emir Erdem", "Ozge", "Murat"]

In [63]:
mixedIndexs = list(zip(firstIndexs, secondIndexs))

In [64]:
mixedIndexs

[('Kurt', 'Mustafa Berat'),
 ('Kurt', 'Ozlem'),
 ('Kurt', 'Selami'),
 ('Günay', 'Emir Erdem'),
 ('Günay', 'Ozge'),
 ('Günay', 'Murat')]

In [65]:
 multiIndex = pn.MultiIndex.from_tuples(mixedIndexs)

In [66]:
newFamilyList = [[10, 200], [20, 400], [60, 100], [90, 1000], [180, 750], [1000, 50]]

In [67]:
npArray = np.array(newFamilyList)

In [68]:
familyDataFrame = pn.DataFrame(npArray, index=multiIndex, columns=["Yaş", "Maaş"])

In [69]:
familyDataFrame

                      Yaş  Maaş
Kurt  Mustafa Berat    10   200
      Ozlem            20   400
      Selami           60   100
Günay Emir Erdem       90  1000
      Ozge            180   750
      Murat          1000    50

In [73]:
familyDataFrame.loc["Kurt"]

               Yaş  Maaş
Mustafa Berat   10   200
Ozlem           20   400
Selami          60   100

In [75]:
familyDataFrame.loc["Kurt"]["Yaş"]

Mustafa Berat    10
Ozlem            20
Selami           60
Name: Yaş, dtype: int32

## Pandas Operasyonlar

In [78]:
dictionary = {"Mersin" : [30, 20, np.nan], "İstanbul" : [np.nan, 40, 20], "Ankara" : [30, 42, 30]}
weatherStateDataFrame = pn.DataFrame(dictionary)
weatherStateDataFrame

   Mersin  İstanbul  Ankara
0    30.0       NaN      30
1    20.0      40.0      42
2     NaN      20.0      30

In [79]:
weatherStateDataFrame.dropna(axis=1)

   Ankara
0      30
1      42
2      30

In [80]:
weatherStateDataFrame.dropna(axis=0)

   Mersin  İstanbul  Ankara
1    20.0      40.0      42

In [84]:
yeniDataMap = {"Mersin" : [30, 20, np.nan], "İstanbul" : [np.nan, 40, 20], "Ankara" : [30, 42, 30], "İzmir" : [20, 40, np.nan]}

In [87]:
yeniDataFrame = pn.DataFrame(yeniDataMap)
yeniDataFrame

   Mersin  İstanbul  Ankara  İzmir
0    30.0       NaN      30   20.0
1    20.0      40.0      42   40.0
2     NaN      20.0      30    NaN

In [94]:
yeniDataFrame.dropna(axis=0)

   Mersin  İstanbul  Ankara  İzmir
1    20.0      40.0      42   40.0

In [96]:
yeniDataFrame.fillna("--")

  Mersin İstanbul  Ankara İzmir
0   30.0       --      30  20.0
1   20.0     40.0      42  40.0
2     --     20.0      30    --

## groupby

In [105]:
data = {"Departmanlar" : ["Yazılım", "Yazılım", "Yazılım", "Hukuk", "Hukuk", "Pazarlama", "Pazarlama"], "Çalışanlar": ["Mustafa Berat", "Selami", "Özlem", "Şevval", "Emir Erdem", "Ceyda", "Elif Naz"], "Maaşlar" : [100, 200, 300, 400, 500, 600, 700]}

In [106]:
dataFrame = pn.DataFrame(data)
dataFrame

  Departmanlar     Çalışanlar  Maaşlar
0      Yazılım  Mustafa Berat      100
1      Yazılım         Selami      200
2      Yazılım          Özlem      300
3        Hukuk         Şevval      400
4        Hukuk     Emir Erdem      500
5    Pazarlama          Ceyda      600
6    Pazarlama       Elif Naz      700

In [110]:
groupObject = dataFrame.groupby("Departmanlar")
groupObject.mean()

              Maaşlar
Departmanlar
Hukuk             450
Pazarlama         650
Yazılım           200

In [112]:
groupObject.max()

             Çalışanlar  Maaşlar
Departmanlar
Hukuk            Şevval      500
Pazarlama      Elif Naz      700
Yazılım           Özlem      300

In [113]:
groupObject.describe()

             Maaşlar
               count   mean         std    min    25%    50%    75%    max
Departmanlar
Hukuk            2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama        2.0  650.0   70.710678  600.0  625.0  650.0  675.0  700.0
Yazılım          3.0  200.0  100.000000  100.0  150.0  200.0  250.0  300.0

In [124]:
dict1 = {"Name" : ["Ahmet", "Mehmet", "Berat", "Şevval"], "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"], "Kalori" : [100, 200,300,400]}
dateFrame1 = pn.DataFrame(dict1, index=np.arange(0,4))

In [125]:
dateFrame1

     Name       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2   Berat       Koşu     300
3  Şevval  Basketbol     400

In [117]:
dict2 = {"Name" : ["Osman", "Atlas", "Atil", "Ozlem"], "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"], "Kalori" : [100, 200,300,400]}
dateFrame2 = pn.DataFrame(dict2, index=np.arange(3, 7))

In [118]:
dateFrame2

    Name       Spor  Kalori
3  Osman       Koşu     100
4  Atlas      Yüzme     200
5   Atil       Koşu     300
6  Ozlem  Basketbol     400

## concatenation

In [128]:
newDataFrame = pn.concat([dateFrame1, dateFrame2])

In [129]:
newDataFrame

     Name       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2   Berat       Koşu     300
3  Şevval  Basketbol     400
3   Osman       Koşu     100
4   Atlas      Yüzme     200
5    Atil       Koşu     300
6   Ozlem  Basketbol     400

In [130]:
newDataFrameGroup = newDataFrame.groupby("Spor")

In [133]:
newDataFrameGroup.count()

           Name  Kalori
Spor
Basketbol     2       2
Koşu          4       4
Yüzme         2       2

## Merge

In [139]:
newDictionary1 = {"Kisiler" : ["Mustafa", "Özlem", "Selami", "Şevval"], "Sporlar" : ["Koşu", "Yüzme", "Koşu", "Basketbol"]}
newDataFrame1 = pn.DataFrame(newDictionary1)

In [140]:
newDictionary2 = {"Kisiler" : ["Mustafa", "Özlem", "Selami", "Şevval"], "Kaloriler" : [100, 200, 300, 700]}
newDataFrame2 = pn.DataFrame(newDictionary2)

In [143]:
pn.merge(newDataFrame1, newDataFrame2, on="Kisiler")

   Kisiler    Sporlar  Kaloriler
0  Mustafa       Koşu        100
1    Özlem      Yüzme        200
2   Selami       Koşu        300
3   Şevval  Basketbol        700

## Pandas İleri Seviye Operasyonlar

In [145]:
salaryDict = {"Kisiler" : ["Mustafa Berat", "Şevval Kurt", "Özlem Kurt", "Selami Kurt"], "Departmanlar" : ["Yazılım", "Pazarlama", "Hukuk", "Yazılım"], "Maaşlar": [100, 200, 300, 400]}
salaryDataFrame = pn.DataFrame(salaryDict)
salaryDataFrame

         Kisiler Departmanlar  Maaşlar
0  Mustafa Berat      Yazılım      100
1    Şevval Kurt    Pazarlama      200
2     Özlem Kurt        Hukuk      300
3    Selami Kurt      Yazılım      400

In [146]:
salaryDataFrame['Departmanlar'].unique()

array(['Yazılım', 'Pazarlama', 'Hukuk'], dtype=object)

In [159]:
salaryDataFrame['Departmanlar'].value_counts()

Yazılım      2
Pazarlama    1
Hukuk        1
Name: Departmanlar, dtype: int64

In [160]:
def bruttenNete(maas):
    return maas * 1.32

In [161]:
salaryDataFrame['Maaşlar'].apply(bruttenNete)

0    132.0
1    264.0
2    396.0
3    528.0
Name: Maaşlar, dtype: float64

In [165]:
salaryDataFrame["Maaşlar"] = None

In [166]:
salaryDataFrame

         Kisiler Departmanlar Maaşlar
0  Mustafa Berat      Yazılım    None
1    Şevval Kurt    Pazarlama    None
2     Özlem Kurt        Hukuk    None
3    Selami Kurt      Yazılım    None

In [169]:
salaryDataFrame.fillna("Maaş Bulunamadı", inplace=True)

In [170]:
salaryDataFrame

         Kisiler Departmanlar          Maaşlar
0  Mustafa Berat      Yazılım  Maaş Bulunamadı
1    Şevval Kurt    Pazarlama  Maaş Bulunamadı
2     Özlem Kurt        Hukuk  Maaş Bulunamadı
3    Selami Kurt      Yazılım  Maaş Bulunamadı

In [172]:
salaryDataFrame['Maaşlar'][0] = 100

In [173]:
salaryDataFrame

         Kisiler Departmanlar          Maaşlar
0  Mustafa Berat      Yazılım              100
1    Şevval Kurt    Pazarlama  Maaş Bulunamadı
2     Özlem Kurt        Hukuk  Maaş Bulunamadı
3    Selami Kurt      Yazılım  Maaş Bulunamadı

In [176]:
salaryDataFrame.isna()

   Kisiler  Departmanlar  Maaşlar
0    False         False    False
1    False         False    False
2    False         False    False
3    False         False    False